{
    "default_answer": "Desculpe, não sei responder a tua pergunta. Podes sempre ensinar-me nas opções desta resposta, e para a próxima já saberei :)",
    "room_reservation": {
        "room_already_reserved": [
            "Pelo que estou a ver no sistema, já tem uma reserva! Quer recomeçar de novo ou alterar esta reserva?",
            "Encontrei uma reserva sua. Pretende alterar ou cancelar esta reserva?"
        ],
        "room_reservation_question": [
            "Para reservar um quarto basta dizer quantas camas quer e o tipo de cama que quer (cama de casal ou cama individual)!",
            "Se pretende efetuar uma reserva basta dizer o número de quartos, o número de camas e o tipo de camas (cama de casal ou individual)!"
        ],
        "missing_datetime": [
            "Indique a data para a qual pretende realizar a reserva, por favor.",
            "Pretende efetuar esta reserva para quando?",
            "Qual o dia e mês que tem em mente?"
        ],
        "missing_bed_type": [
            "Que tipo de cama pretende? Cama de casal ou individual?",
            "Cama de casal ou individual?",
            "Cama de casal? Ou cama individual?"
        ],
        "missing_bed_quantity": [
            "De quantas camas necessita no quarto?",
            "Sendo assim, quantas camas prentende no seu quarto?"
        ],
        "missing_room_quantity": [
            "Quantos quartos pretende reservar?"
        ],
        "missing_confirmation": [
            "Deseja confirmar a reserva?",
            "Podemos então concluir a reserva?",
            "Confirmamos a reserva?"
        ],
        "reservation_success": [
            "O seu quarto foi reservado com sucesso! Reveja os detalhes: ",
            "Prontinho, já tem a sua reserva efetuada. Vou fazer um pequeno resumo com os detalhes: "
        ],
        "reservation_fail": [
            "Compreendo. Espero voltar a falar consigo e espero que numa próxima vez fique connosco! Até à próxima!",
            "Sem problema. Volte sempre!"
        ],
        "reservation_prices": [
            "Um quarto com uma cama de casal custa {0}€. Se preferir cama individual, custa {1}€",
            "Depende do tipo de cama. Se for cama de casal, custa {0}€. No entanto, pode optar por cama individual, e fica por {1}€"
        ]
    },
    "room_change": {
        "room_not_reserved_yet": "Não encontrei a sua reserva no sistema. Tem a certeza que efetuou uma reserva?",
        "room_change_intro": [
            "Certíssimo, sem problema. O que deseja então alterar?",
            "Necessita de mais camas ou pretende alterar o tipo de cama? A data está correta?",
            "Então? Precisa de mudar de data? Ou aumentar o numero de camas?"
        ],
        "confirming_changes" : [
            "Como houve uma alteração na sua reserva, aprensento-lhe o novo resumo: {0}. </br>Note que o número do quarto mudou, assim como o preço.</br>Pretende confirmar?",
            "Sendo assim, devido às alterações que realizou, o número do quarto mudou. Aprensento-lhe o novo resumo da sua reserva: {0}.</br>Pretende confirmar? Note que o preço alterou!",
            "Está feito! Como foi efetuada uma alteração na sua reserva, o número do quarto mudou, tal como o preço.</br>Aprensento-lhe então o novo resumo da sua reserva: {0}.</br>Pretende confirmar?"
        ],
        "no_changes_identified": [
            "Não notámos qualquer alteração na sua reserva. O que pretende alterar mesmo?",
            "Os dados que nos indicou já são os da sua reserva, não se precisa de preocupar!"
        ],
        "change_success": [
            "Alterações efetuadas. Desejo-lhe uma boa estadia!",
            "Está feito. Alterações feitas. Obrigado e desejo-lhe uma ótima estadia!"
        ],
        "change_fail": [
            "Certo. Sendo assim, fica tudo como está! Tenha uma boa estadia!",
            "Ok, sem problema. Sendo assim, desejo-lhe uma boa estadia!"
        ],
        "date_change": [
            "Ou seja, quer alterar a data de dia {0} para dia {1}?",
            "Sendo assim, alteramos a data de {0} para dia {1}?"
        ]
    },
    "room_cancel": {
        "no_reservation_found": [
            "Peço desculpa, mas não encontrei a sua reserva. Não consigo cancelar algo que não está marcado!",
            "A sua reserva não se encontra no sistema. Efetue uma reserva primeiro."
        ],
        "cancel_confirmation": [
            "Entendido. </br>A reserva: {0}.</br>Deseja cancelar esta reserva?",
            "Lamento saber. </br>A sua reserva é esta: {0}.</br>Pretende realmente cancelar?"
        ],
        "cancel_success": [
            "A sua reserva foi cancelada. Obrigado.",
            "Lamento que não tenhamos correspondido às expectativas. A sua reserva foi cancelada. Obrigado."
        ],
        "cancel_fail": [
            "Excelente! Obrigado por continuar connosco.",
            "A sua reserva continua marcada! Obrigado pela confiança."
        ]
    },
    "gym_access": {
        "gym": [
            "Temos um ginásio muito acolhedor!",
            "O nosso ginásio é muito espaçoso.",
            "O ginásio tem um rating 5 estrelas"
        ],
        "gym_machines":[
            "Temos todas as máquinas que existem!",
            "O nosso ginánio está todo equipado!",
            "As máquinas que temos são todas completas!"
        ],
        "access_price":[
            "Quem está no hotel não paga entrada, para restantes é 5€.",
            "A entrada são 5€, para quem está no hotel é grátis!",
            "É o preço de 5€ a entrada com a excessão de pessoas com quarto!"
        ]

    },
    "pool_access": {
        "pool": [
            "A nossa piscina é muito grande!",
            "Temos duas piscinas muito fundas!",
            "As piscinas são muito bonitas."
        ],
        "pool_objects":[
            "As piscinas têm otimas sobras e espreguiçadeiras e todo o tipo de brinquedos aquáticos!",
            "Temos muitos acessório aquáticos e belas sombras á volta da piscina com espreguiçadeiras!",
            "Temos todo o equimamente aquático e locais para descansar á sombra!"
        ],
        "access_price":[
            "Quem está no hotel não paga entrada, para restantes é 2€.",
            "A entrada são 2€, para quem está no hotel é grátis!",
            "É o preço de 2€ a entrada com a excessão de pessoas com quarto!"
        ]

    }
    
}